{
    "organizer": "Mr.Hiller",
    "date": "June 17, 2019",
    "title": "Newcomers Academy Field Day",
    "images": 3,
    "mentors": ["Mr.Hiller"],
    "students":["Luke", "Lauren", "Arnav", "Rohit", "Ben"],
    "location": "Nichols School, Buffalo NY",
    "audience": "50-60 Middle School to High School Students ",
    "info": [
        ["h3", "We participated in our school's field day event to entertain and excite the young minds of the Newcomer Academy,a school consisting of students from a diverse set of backgrounds"],
        "Our high school, Nichols, planned out a enjoyable summer field day for the students of the Necomer Academy to enjoy. Events included soccer, basketball, sidewalk chalk drawings, henna and a showcase of our robots. We were told to expect half an hour to fourty five minute sessions of groups of twenty students visiting us, so we brought out a variety of our projects for them to demonstrate. We had our two 2019 FTC bots available to drive and play with, HOWARD fishbot to display, and our 2019 FRC Bot Dr. Julius Strangepork to play a game of catch with students.",
"The event went as expected, with lots of interested students coming to see the robots.With Strangepork, the ball limit switch sensor wasn't behaving properly at the start of the demo, so the code had to be rewritten to accomadate for that. Our FTC bots worked well throughout with minor communication issues and the occasional falling off the platform by an new student learning to drive. Students loved playing catch with Strangepork, and some of our teammates discovered that Strangepork can be used as an excellent pitcher for kickball. The FTC bots were also very popular as students took turns competing who could stack the most. Overall, as a robotics event and as a schoolwide event, the field day was a major success "
    
    ],
    "lesson": "We did not experience many issues during the event. Our communication amongst ourselves and the school student body coordinators was excellent and we were set up half an hour in advance of the Newcomer students' arrival. One thing that we can keep in mind for the future though, is that students may get bored by doing the same actions with the robots, so it is good to plan out more ways for them to use the bots, such as kickball. "

}